Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/J76.tmx
Source language: en_us
Languages: zh_cn

source: 2 Mathematical Modeling of Control Systems
zh_cn: 第2章 控制系统的数学模型

source: 2.1 INTRODUCTION
zh_cn: 2.1 引言

source: In studying control systems the reader must be able to model dynamic systems in mathematical terms and analyze their dynamic characteristics.
zh_cn: 在研究控制系统时，读者必须能够建立动态系统的数学模型，并且会分析系统的动态特性。

source: A mathematical model of a dynamic system is defined as a set of equations that represents the dynamics of the system accurately, or at least fairly well.
zh_cn: 动态系统的数学模型是一组方程式，它精确地或至少相当好地表示了系统的动态特性。

source: Note that a mathematical model is not unique to a given system. A system may be represented in many different ways and, therefore, may have many mathematical models, depending on one’s perspective.
zh_cn: 应当指出，对于给定的系统，数学模型不是唯一的，一个系统可以用不同的方式表示。因此，对于人们的不同观点，一个系统可以具有许多种数学模型。

source: The dynamics of many systems, whether they are mechanical, electrical, thermal, economic, biological, and so on, may be described in terms of differential equations.
zh_cn: 许多系统，不管它们是机械的、电气的、热力的，还是经济学的、生物学的，其动态特性都可以用微分方程来描述。

source: Such differential equations may be obtained by using physical laws governing a particular system--for example, Newton’s laws for mechanical systems and Kirchhoff’s laws for electrical systems.
zh_cn: 这些微分方程可以通过利用支配具体系统的物理学定律，例如机械系统中的牛顿定律和电气系统中的基尔霍夫定律来得到。

source: We must always keep in mind that deriving reasonable mathematical models is the most important part of the entire analysis of control systems.
zh_cn: 必须牢记，导出一个合理的数学模型是整个分析过程中最重要的工作。

source: Throughout this book we assume that the principle of causality applies to the systems considered.
zh_cn: 本书自始至终假设，因果律适用于所研究的系统。

source: This means that the current output of the system (the output at time t=0) depends on the past input (the input for t0).
zh_cn: 这意味着系统当前的输出（即t=0时的输 出）与过去的输入量（即t0时的输入量）无关。

source: Mathematical Models.
zh_cn: 数学模型

source: Mathematical models may assume many different forms.
zh_cn: 数学模型可以有多种形式。

source: Depending on the particular system and the particular circumstances, one mathematical model may be better suited than other models.
zh_cn: 随着具体系统和具体条件的不同，一种数学模型可能比另一种更合适。

source: For example, in optimal control problems, it is advantageous to use state-space representations.
zh_cn: 例如，在最佳控制问题中，采用状态空间表达式比较有利。

source: On the other hand, for the transient-response or frequency-response analysis of single-input, single-output, linear, time-invariant systems, the transfer-function representation may be more convenient than any other.
zh_cn: 另一方面，在单输入、单输出的线性定常系统的瞬态响应或频率响应分析中，采用传递函数表达式可能比其他方法更为方便。

source: Once a mathematical model of a system is obtained, various analytical and computer tools can be used for analysis and synthesis purposes.
zh_cn: 一旦获得了系统的数学模型，就可以采用各种分析方法和计算机工具对系统进行分析和综合。

source: Simplicity Versus Accuracy.
zh_cn: 简化性和精确性

source: In obtaining a mathematical model, we must make a compromise between the simplicity of the model and the accuracy of the results of the analysis.
zh_cn: 在建立数学模型时，必须在模型的简化性与分析结果的精确性之间做出折中考虑。

source: In deriving a reasonably simplified mathematical model, we frequently find it necessary to ignore certain inherent physical properties of the system.
zh_cn: 在推导合理的简化数学模型时，我们发现常常需要忽略系统的一些固有物理特性。

source: In particular, if a linear lumped-parameter mathematical model (that is, one employing ordinary differential equations) is desired, it is always necessary to ignore certain nonlinearities and distributed parameters that may be present in the physical system.
zh_cn: 特别是当采用线性集总参数数学模型（即常微分方程）时，总是需要忽略物理系统中可能存在的一定的非线性因素和分布参数（即导致偏微分方程的因素）。

source: If the effects that these ignored properties have on the response are small, good agreement will be obtained between the results of the analysis of a mathematical model and the results of the experimental study of the physical system.
zh_cn: 如果这些被忽略掉的因素对响应的影响比较小，那么数学模型的分析结果与物理系统的实验研究结果将很好地吻合。

source: In general, in solving a new problem, it is desirable to build a simplified model so that we can get a general feeling for the solution.
zh_cn: 一般来说，在求解一个新问题时，常常需要建立一个简化模型，以对问题的解有一般的了解。

source: A more complete mathematical model may then be built and used for a more accurate analysis.
zh_cn: 然后再建立比较完善的数学模型，并用来对系统进行比较精确的分析。

source: We must be well aware that a linear lumped-parameter model, which may be valid in low-frequency operations, may not be valid at sufficiently high frequencies, since the neglected property of distributed parameters may become an important factor in the dynamic behavior of the system.
zh_cn: 必须清楚地认识到，线性集总参数模型只是在低频范围工作时才合适。当频率相当高时，由于被忽略的分布参数特性可能变成系统动态特性中的重要因素，所以仍作为集总参数模型来研究是不恰当的。

source: For example, the mass of a spring may be neglected in low-frequency operations, but it becomes an important property of the system at high frequencies.
zh_cn: 例如，在低频范围工作时，弹簧的质量可以忽略，但是在高频范围工作时，弹簧的质量却可能变成系统的重要性质。

source: (For the case where a mathematical model involves considerable errors, robust control theory may be applied.
zh_cn: 在这种情况下，数学模型会包含着相当大的误差，鲁棒控制理论可能适用于这种情况。

source: Robust control theory is presented in Chapter 10.)
zh_cn: 第10章将会介绍鲁棒控制理论。

source: Linear Systems.
zh_cn: 线性系统

source: A system is called linear if the principle of superposition applies.
zh_cn: 如果系统满足叠加原理，则称其为线性系统。

source: The principle of superposition states that the response produced by the simultaneous application of two different forcing functions is the sum of the two individual responses.
zh_cn: 叠加原理表明，两个不同的作用函数同时作用于系统的响应，等于两个作用函数单独作用的响应之和。

source: Hence, for the linear system, the response to several inputs can be calculated by treating one input at a time and adding the results.
zh_cn: 因此，线性系统对几个输入量同时作用的响应可以一个一个地处理，然后对响应结果进行叠加。

source: It is this principle that allows one to build up complicated solutions to the linear differential equation from simple solutions.
zh_cn: 由于这一原理，使我们有可能由一些单解构造出线性微分方程的复杂解。

source: In an experimental investigation of a dynamic system, if cause and effect are proportional, thus implying that the principle of superposition holds, then the system can be considered linear.
zh_cn: 在动态系统的实验研究中，如果输人量和输出量成正比，则意味着满足叠加原理，因而可以把系统看成线性系统。

source: Linear Time-Invariant Systems and Linear Time-Varying Systems.
zh_cn: 线性定常系统和线性时变系统

source: A differential equation is linear if the coefficients are constants or functions only of the independent variable.
zh_cn: 如果微分方程的系数是常数，或者仅仅是自变量的函数，则该微分方程是线性的。

source: Dynamic systems that are composed of linear time-invariant lumped-parameter components may be described by linear time-invariant differential equations--that is, constant-coefficient differential equations. Such systems are called linear time-invariant (or linear constant-coefficient) systems.
zh_cn: 由线性定常集总参数元件构成的动态系统，可以用线性定常（常系数）微分方程描述，这类系统称为线性定常 （或线性常系数）系统。

source: Systems that are represented by differential equations whose coefficients are functions of time are called linear time-varying systems.
zh_cn: 如果描述系统的微分方程的系数是时间的函数，则称这类系统为线性时变系统。

source: An example of a time-varying control system is a spacecraft control system. (The mass of a spacecraft changes due to fuel consumption.)
zh_cn: 宇宙飞船控制系统就是时变控制系统的一个例子（宇宙飞船的质量随着燃料的消耗而变化）。

source: In control theory, functions called transfer functions are commonly used to characterize the input-output relationships of components or systems that can be described by linear, time-invariant, differential equations.
zh_cn: 在控制理论中，为了表示能够用线性常微分方程描述的元件或系统的输入——输出关系，经常要应用所谓的传递函数。

source: We begin by defining the transfer function and follow with a derivation of the transfer function of a differential equation system. Then we discuss the impulse-response function.
zh_cn: 本节首先定义传递函数，然后导出一种微分方程系统的传递函数，最后 讨论脉冲响应函数。

source: 2.2.1 Transfer Function.
zh_cn: 2.2.1 传递函数

source: The transfer function of a linear, time-invariant, differential equation system is defined as the ratio of the Laplace transform of the output (response function) to the Laplace transform of the input (driving function) under the assumption that all initial conditions are zero.
zh_cn: 线性微分方程系统的传递函数定义为：在全部初始条件为零的假设下，输出量（响应函数）的拉普拉斯变换与输入量（驱动函数）的拉普拉斯变换之比。

source: Consider the linear time-invariant system defined by the following differential equation: . . . where y is the output of the system and x is the input.
zh_cn: 考虑由下列微分方程描述的线性定常系统：. . .式中，y为系统输出量，x为系统输人量。

source: The transfer function of this system is the ratio of the Laplace transformed output to the Laplace transformed input when all initial conditions are zero, or . . .
zh_cn: 在全部初始条件为零时，输出量与输人量的拉普拉斯变换之比，就是这个系统的传递函数。. . .

source: By using the concept of transfer function, it is possible to represent system dynamics by algebraic equations in s.
zh_cn: 利用传递函数的概念，可以用以s为变量的代数方程表示系统的动态特性。

source: If the highest power of s in the denominator of the transfer function is equal to n, the system is called an nth-order system.
zh_cn: 如果传递函数的分母中s的最高阶次为n，则称系统为n阶系统。

source: 2.2.2 Comments on Transfer Function.
zh_cn: 2.2.2 传递函数的说明

source: The applicability of the concept of the transfer function is limited to linear, time-invariant, differential equation systems.
zh_cn: 传递函数概念的适用范围限于线性常微分方程系统。

source: The transfer function approach, however, is extensively used in the analysis and design of such systems.
zh_cn: 当然，在这类系统的分析和设计中，传递函数方法的应用是很广泛的。

source: In what follows, we shall list important comments concerning the transfer function. (Note that a system referred to in the list is one described by a linear, time-invariant, differential equation.)
zh_cn: 下面我们将列出有关传递函数的一些重要说明（在下列各项说明中涉及的均为线性常微分方程描述的系统）。

source: 1.The transfer function of a system is a mathematical model in that it is an operational method of expressing the differential equation that relates the output variable to the input variable.
zh_cn: 1. 系统的传递函数是一种数学模型，它表示联系输出变量与输入变量的微分方程的一种运算方法。

source: 2. The transfer function is a property of a system itself, independent of the magnitude and nature of the input or driving function.
zh_cn: 2.传递函数是系统本身的一种属性，它与输入量或驱动函数的大小和性质无关。

source: 3. The transfer function includes the units necessary to relate the input to the output; however, it does not provide any information concerning the physical structure of the system. (The transfer functions of many physically different systems can be identical.)
zh_cn: 3.传递函数包含联系输入量与输出量所必需的单位，但是它不提供有关系统物理结构的任何信息（许多物理上完全不同的系统，可以具有相同的传递函数）。

source: 4. If the transfer function of a system is known, the output or response can be studied for various forms of inputs with a view toward understanding the nature of the system.
zh_cn: 4.如果系统的传递函数已知，则可以针对各种不同形式的输入量，研究系统的输出或响应，以便掌握系统的性质。

source: 5. If the transfer function of a system is unknown, it may be established experimentally by introducing known inputs and studying the output of the system.
zh_cn: 5.如果不知道系统的传递函数，则可以通过引入已知输入量并研究系统输出量的实验方法，确定系统的传递函数。

source: Once established, a transfer function gives a full description of the dynamic characteristics of the system, as distinct from its physical description.
zh_cn: 系统的传递函数一旦被确定，就能够对系统的动态特性进行充分描述，它不同于对系统的物理描述。

source: 2.2.3 Convolution Integral.
zh_cn: 2.2.3 卷积积分

source: For a linear, time-invariant system the transfer function G(s) is . . . where X(s) is the Laplace transform of the input to the system and Y(s) is the Laplace transform of the output of the system, where we assume that all initial conditions involved are zero.
zh_cn: 对于线性定常系统，其传递函数C（s）为. . .式中，X（s）为输入量的拉普拉斯变换，Y（s）为输出量的拉普拉斯变换，并且假设所有初始条件均为零。

source: It follows that the output Y(s) can be written as the product of G(s) and X(s), or . . .
zh_cn: 由此可见，输出量可以写成G（s）与X（s）的乘积，即. . .

source: Note that multiplication in the complex domain is equivalent to convolution in the time domain (see Appendix A), so the inverse Laplace transform of Equation (2-1) is given by the following convolution integral: . . . where both g(t) and x(t) are 0 for t<0.
zh_cn: 注意，复域内的乘法等效于时域内的卷积（见附录A），所以方程（2.1）的拉普拉斯反变换可以由下列卷积积分得到：. . .式中，当 t<0 时，g（t） =0 且 想x（t）=0。

source: 2.2.4 Impulse-Response Function.
zh_cn: 2.2.4 脉冲响应函数

source: Consider the output (response) of a linear time-invariant system to a unit-impulse input when the initial conditions are zero.
zh_cn: 考虑当初始条件等于零时，线性定常系统在单位脉冲输人量作用下的输出（响应）。

source: Since the Laplace transform of the unit-impulse function is unity, the Laplace transform of the output of the system is . . .
zh_cn: 因为单位脉冲函数的拉普拉斯变换为1，所以系统输出量的拉普拉斯变换为. . .

source: The inverse Laplace transform of the output given by Equation (2.2) gives the impulse response of the system.
zh_cn: 对方程（2.2）给出的输出量进行拉普拉斯反变换，可以得到系统的脉冲响应。

source: The inverse Laplace transform of G(s), or . . . is called the impulse-response function. This function g(t) is also called the weighting function of the system.
zh_cn: G（s）的拉普拉斯反变换，即. . .称为脉冲响应函数，函数也称为系统的权函数。

source: The impulse-response function g(t) is thus the response of a linear time-invariant system to a unit-impulse input when the initial conditions are zero. The Laplace transform of this function gives the transfer function.
zh_cn: 因此，脉冲响应函数是当初始条件为零时，线性定常系统对单位脉冲输入的响应，该函数的拉普拉斯变换就是传递函数。

source: Therefore, the transfer function and impulse-response function of a linear, time-invariant system contain the same information about the system dynamics.
zh_cn: 所以，线性定常系统的传递函数和脉冲响应函数包含关于系统动态特性的相同信息。

source: It is hence possible to obtain complete information about the dynamic characteristics of the system by exciting it with an impulse input and measuring the response.
zh_cn: 于是，通过用脉冲输入信号激励系统并测量系统的响应，能够获得有关系统动态特性的全部信息

source: (In practice, a pulse input with a very short duration compared with the significant time constants of the system can be considered an impulse.)
zh_cn: （实际上，与数值较大的系统时间常数相比，持续时间很短的脉冲输人信号可以看成脉冲输入信号）。

source: 2.3 AUTOMATIC CONTROL SYSTEMS
zh_cn: 2.3 自动控制系统

source: A control system may consist of a number of components.
zh_cn: 控制系统可以由许多元件组成。

source: To show the functions performed by each component, in control engineering, we commonly use a diagram called the block diagram.
zh_cn: 为了表明每一元件在系统中的功能，在控制工程中常常用到方框图的概念。

source: This section first explains what a block diagram is. Next, it discusses introductory aspects of automatic control systems, including various control actions.
zh_cn: 本节首先说明什么是方框图，然后讨论自动控制系统的初步知识，包括各种控制作用。

source: Then, it presents a method for obtaining block diagrams for physical systems, and, finally, discusses techniques to simplify such diagrams.
zh_cn: 最后介绍获得物理系统方框图的方法，并讨论简化方框图的技术。

source: 2.3.1 Block Diagrams.
zh_cn: 2.3.1 方框图

source: A block diagram of a system is a pictorial representation of the functions performed by each component and of the flow of signals. Such a diagram depicts the interrelationships that exist among the various components.
zh_cn: 系统的方框图是系统中每个元件的功能和信号流向的图解表示，表明系统中各种元件之间的相互关系。

source: Differing from a purely abstract mathematical representation, a block diagram has the advantage of indicating more realistically the signal flows of the actual system.
zh_cn: 方框图不同于纯抽象的数学表达式，它的优点是能够更真实地表明实际系统中的信号流动情况。

source: In a block diagram all system variables are linked to each other through functional blocks.
zh_cn: 在方框图中，通过功能方框，可以将所有的系统变量相互联系起来。

source: The functional block or simply block is a symbol for the mathematical operation on the input signal to the block that produces the output.
zh_cn: 功能方框，简称方框，是描述加到方框上的输入信号的一种数学运算符号。运算结果以输出量表示。

source: The transfer functions of the components are usually entered in the corresponding blocks, which are connected by arrows to indicate the direction of the flow of signals.
zh_cn: 元件的传递函数通常写进相应的方框中，并以标明信号流向的箭头将其连接起来。

source: Note that the signal can pass only in the direction of the arrows.
zh_cn: 信号只能沿着箭头方向通过。

source: Thus a block diagram of a control system explicitly shows a unilateral property.
zh_cn: 因此，控制系统的方框图清楚地表示了它的单向特性。

source: Figure 2-1 shows an element of the block diagram.
zh_cn: 图2.1所示为一个方框图单元。

source: The arrowhead pointing toward the block indicates the input, and the arrowhead leading away from the block represents the output.
zh_cn: 指向方框的箭头表示输入，从方框出来的箭头表示输出。

source: Such arrows are referred to as signals.
zh_cn: 在这些箭头上标明了相应的信号。

source: Note that the dimension of the output signal from the block is the dimension of the input signal multiplied by the dimension of the transfer function in the block.
zh_cn: 从方框出来的输出信号的因次，等于输人信号的因次与方框中传递函数因次的乘积。

source: The advantages of the block diagram representation of a system are that it is easy to form the overall block diagram for the entire system by merely connecting the blocks of the components according to the signal flow and that it is possible to evaluate the contribution of each component to the overall performance of the system.
zh_cn: 用方框图表示系统的优点是：只要依据信号的流向将各个元件的方框连接起来，就能够容易地组成整个系统的方框图，还可以通过方框图评价每一元件对系统总体性能的影响。

source: In general, the functional operation of the system can be visualized more readily by examining the block diagram than by examining the physical system itself.
zh_cn: 总之，方框图比物理系统本身更容易体现系统的函数功能。

source: A block diagram contains information concerning dynamic behavior, but it does not include any information on the physical construction of the system.
zh_cn: 方框图包含了与系统动态特性有关的信息，但是它不包括与系统物理结构有关的任何信息。

source: Consequently, many dissimilar and unrelated systems can be represented by the same block diagram.
zh_cn: 因此，许多完全不同和根本无关的系统可以用同一个方框图来表示。

source: It should be noted that in a block diagram the main source of energy is not explicitly shown and that the block diagram of a given system is not unique.
zh_cn: 在方框图中没有明显地表示出系统的主能源，而且对于给定的系统来说，方框图也不是唯一的。

source: A number of different block diagrams can be drawn for a system, depending on the point of view of the analysis.
zh_cn: 由于分析的角度不同，对于同一个系统可以画出许多不同的方框图。
